Revit 2025 API
ElectricalPerPhaseData Properties
The ElectricalPerPhaseData type exposes the following members.
Properties
Name | Description
CurrentPhaseA |  The value of current on electrical phase A.
CurrentPhaseB |  The value of current on electrical phase B.
CurrentPhaseC |  The value of current on electrical phase C.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ElectricalPerPhaseData Class
Autodesk.Revit.DB.Electrical Namespace